import TopSlideShow from '../components/TopSlideShow/TopSlideShow';
import CountDown from '../components/CountDown/CountDown';
import News from '../components/News/News';
import { InfoSection } from '../components/InfoSection/InfoSection';

import styles from './page.module.scss';
import Access from '../components/Access/Access';

export default function HomePage() {
  return (
    <>
      <div className={styles.container}>
        <TopSlideShow />
        <CountDown />
        <News />
        <InfoSection title='田沢神父/校長先生 挨拶'>
          <p>SF(スクールフェア)に、ようこそおいでくださいました。</p>
          <p>
            楽しい時を過ごしてほしいと思います。今年のテーマは「SinFonia」(調和)です。
            <br />
            シンフォニアは、ギリシア語の「syn-(一緒に)」と「phone(音)」を語源とするイタリア語で、合奏曲を意味する言葉です。多くの楽器が調和して、全体として良い音を奏でるものになることを期待します。
          </p>
          <p>
            生徒たちは、今日のために様々な企画を準備してきましたが、
            皆さんに喜んでもらえることを意識してきたと思います。
            準備段階では苦労もありますが、共に協力して何かを作り出すのは、
            大きな喜びです。そして、本番でお客さんの笑顔を見るのもうれしいものです。
          </p>
          <p>それでは、ゆっくりとお楽しみください。</p>
        </InfoSection>
        <InfoSection title='中井先生/SF運営委員最高教員 挨拶'>
          <p>
            まず表題について。スクールフェア（以下、SF）をここまで作り上げてくれた生徒を動物扱いしているわけでは決してありません、悪しからず。
            <br />
            今日は校舎全体がサバンナです。鳴き声も足音も、「SF」というキーワードから育った多様な“生態”の響き。観察にとどまらず、どうぞ“ふれあい”を楽しんでください。
          </p>
          <p>
            そしてご来場のみなさま、本日は SF
            にお越しいただきありがとうございます。
            SFは、保護者のみなさま、友人の方々、星光への受験を考えてくださっている方々…さまざまな角度から星光と関わる皆さまに、生徒の「いま」を最も近くで実感していただける場だと自負しています。
          </p>
          <p>
            １学期から少しずつ準備を続けてきた大型企画もありますが、多くの企画はわずか一週間ほどの準備で今日を迎えました。拙さが顔を出す場面もあるかもしれません。
            <br />
            しかしすべての企画に共通するのは、「来てくださる人に喜んでもらいたい」というまっすぐな気持ちです。少し大袈裟に言えば、生徒たちの「美の追求」が企画という形となって立ち上がっているのです。
            <br />
            その光がみなさんの光に少しでもなれば、これ以上の幸せはありません。
          </p>
          <p>
            大きな声で呼び込みをする生徒。おずおずと目線を泳がせる生徒。調理に没頭する生徒、来場者と真剣に碁盤をにらむ生徒、バンド演奏、漫才、ラップ…。どうぞ思う存分、星光生の多様な“生態”と触れ合ってください。ライオンや虎のように凶暴さはありません――そこはご安心を。その代わり、情熱と好奇心は野性味たっぷりです。
            <br />
            最後に運営へのご協力を少し。大勢の来場者が予想され、その混雑に伴い皆さまには円滑なおもてなしが出来ないことも懸念されます。何卒ご容赦いただき、生徒たちの運営を暖かく見守っていただけると幸いです。
          </p>
        </InfoSection>
        <InfoSection title='中村/SF運営委員長 挨拶'>
          <p>
            2025年度SFにようこそ！SF運営委員長を担当しております中村天です。
          </p>
          <p>
            「とにかく、みんなが楽しいと言っちゃうSFを作りたい！」という気持ちでここまで頑張ってきました。
            <br />
            学校中の生徒がこの日のためにたくさんの準備をしてきました。それら全てが一つにまとまった「SinFonia」がみなさんの心に響くのを願っております。
            <br />
            とにかく楽しんでください！
          </p>
        </InfoSection>
        <InfoSection title='柳原/SF運営副委員長 挨拶'>
          <p>2025年度SFにご来場ありがとうございます。</p>
          <p>
            この星光のSFに来られたのが何回目であれ、毎年違ったワクワク体験があなたに待っています！
            <br />
            1日という短い間のために生徒が全力で作り上げた集大成をぜひ見ていってください！
          </p>
        </InfoSection>
        <Access />
      </div>
      <div className={styles.logo_box}>
        <img src='/icon/sf-logo-color.svg' width={400} />
      </div>
    </>
  );
}
